{
    "projects": [
        {
            "name": "Games",
            "projects": [
                {
                    "name": "Ignition Arena",
                    "id": "ignitionArena",
                    "description": "An online multiplayer, top-down space arena shooter with ship-building and flight mechanics published on Steam.",
                    "descriptionLong": "I worked at Expedition Games as the main engineer out of 2. I worked there for about 8 months before the main vision holder continued it on his own, set to release in early 2025. Ignition Arena is a free-to-play, fast-paced, tactical PvP game where players build and customize ships for intense space battles. Compete in dynamic arenas featuring strategic combat, skill-based mechanics, and extensive ship customization. Outsmart and outgun opponents to claim victory!",
                    "duration": "8 months",
                    "link": "https://store.steampowered.com/app/3228760/Ignition_Arena",
                    "screenshots": [
                        2,
                        3,
                        1,
                        4,
                        5
                    ],
                    "credits": [
                        "Tayin Wallace - Systems Engineer",
                        "Taylor Dabrowski - Producer",
                        "Cam Knigh - Lead",
                        "Josh - Art",
                        "Rachel - Art",
                        "A contractors for art and narrative"
                    ],
                    "tools": [
                        "unity",
                        "csharp",
                        "photoshop",
                        "git",
                        "github",
                        "jira"
                    ],
                    "sections": [
                        {
                            "title": "Contributions",
                            "body": "My main task was to program all of the systems within the game. I was in charge of almost all of the code within the game except for the dedicated server code, some other back-end code, and some smaller front-end parts. Most of my time was spent on networking, shipbuilding, and ship flight. I also spent a lot of time setting up the UI, ensuring quality art was being created, helping with design, and assembling each ship component into a workable part of the game."
                        },
                        {
                            "title": "Networking",
                            "body": "The networking within the game allows for multiplayer through a dedicated server of matches that consist of small teams. We used Unity's Netcode systems. We utilized a dedicated server, lobby system, friends system, and more. The part that took the longest was the client prediction and reconciliation. This was to protect against cheaters within the game. However, physics-based client prediction is the most challenging type. We ran into many bugs where the physics didn't line up across the server and clients. Ultimately, we got a pretty good system setup where it only bugged out at faster speeds."
                        }
                    ]
                },
                {
                    "name": "Hazard Miner",
                    "id": "hazardMiner",
                    "description": "It is a 1-4-player card game where you have to balance safety and greed to gather as many resources as possible.",
                    "descriptionLong": "Hazard Miner is a card game that started as a solo print-and-play project for an intro-level game design university course. The game required minimal art. After the course ended, I continued the project, turning it solo and multiplayer and adding some art using the newer Midjourney AI image generation software. After that, I published the game on The Game Crafter. It ended up being a card game where you must balance mining for minerals in different mineshafts and protecting your minerals from dangerous explosions and greed.",
                    "duration": "8 months",
                    "link": "https://www.thegamecrafter.com/games/hazard-miner",
                    "screenshots": [
                        4,
                        1,
                        2,
                        3
                    ],
                    "credits": [
                        "Tayin Wallace - Sole Developer"
                    ],
                    "tools": [
                        "midjourney",
                        "photoshop"
                    ],
                    "sections": []
                },
                {
                    "name": "Iteration",
                    "id": "iteration",
                    "description": "A topdown bossrush where you hack-and-slash through unique bosses and environments with fast-paced combat.",
                    "descriptionLong": "Iteration is a topdown 2D bossrush game where you hack-and-slash your way through different bosses in different environments. Fight your way through bosses using the fast-paced sword-fighting combat. This is a current on going project of mine where I plan to release the game to Steam and go through the whole process of producation and promotion for a game.",
                    "duration": "on going",
                    "link": "https://store.steampowered.com/app/3638280/Iteration",
                    "screenshots": [
                        1,
                        2,
                        3,
                        4,
                        5
                    ],
                    "credits": [
                        "Tayin Wallace - Solo Developer"
                    ],
                    "tools": [
                        "unity",
                        "csharp",
                        "photoshop",
                        "git",
                        "github"
                    ],
                    "sections": []
                },
                {
                    "name": "The Flip Side",
                    "id": "theFlipSide",
                    "description": "A game where you flip between two mirrored worlds to fight enemies and solve puzzles, made by a team of 8.",
                    "descriptionLong": "The Flip Side project was created by a small team of 8 for a university course. The idea was to create a game where you could flip back and forth between 2 worlds, solve puzzles, and fight enemies to progress. There is the forest world and the city world, each with puzzles that correspond with and affect the other world.",
                    "duration": "3 months",
                    "link": "https://chromecore.itch.io/the-flip-side",
                    "screenshots": [
                        1,
                        2,
                        3,
                        4
                    ],
                    "credits": [
                        "Azel Akhmetova - Producer",
                        "Rachel Buzarde - Artist",
                        "Jake Orantes - Artist",
                        "Samuel Ruske - Audio",
                        "Max Sone - Programmer",
                        "Nolan Taylor - Programmer",
                        "Tayin Wallace - Programmer",
                        "Mahonri White - Programmer / Designer"
                    ],
                    "tools": [
                        "unity",
                        "csharp",
                        "photoshop",
                        "git",
                        "github"
                    ],
                    "sections": []
                },
                {
                    "name": "Beamdown",
                    "id": "beamdown",
                    "description": "A boss rush action game focused on combat where you play as a robot clearing worlds of enemies made by a team of 30.",
                    "descriptionLong": "Beamdown is a game made as part of my senior capstone project at university. The course lasted a full 9 months (2 semesters), and was composed of 30 students making a game while going through regular industry steps. These phases include prototype, alpha, beta, gold, and live ops. The initial idea for the game was to create a top-down boss rush focused on combat, bosses, and environment.",
                    "duration": "on going",
                    "link": "https://store.steampowered.com/app/3466230/Beamdown/",
                    "screenshots": [
                        3,
                        1,
                        2,
                        4
                    ],
                    "credits": [
                        "Tayin Wallace - Lead / Engineer",
                        "29 others in art/engineering/design/audio"
                    ],
                    "tools": [
                        "unity",
                        "csharp",
                        "photoshop",
                        "steam",
                        "git",
                        "github",
                        "jira"
                    ],
                    "sections": [
                        {
                            "title": "Contributions",
                            "body": "Throughout this project, I acted as the main vision holder and lead engineer. Lead-wise, I helped ensure the development process was going smoothly and helped settle any debates or arguments that occurred. I also helped with the general assignments for the course, presentations, and the setup for Steam. As lead engineer, I was responsible for ensuring the quality of code was good and assigning tasks to my engineers, as well as ensuring I got updates on the progress of those tasks. Engineering-wise, I was responsible for creating the combat system for the player. I also did a lot of systems here and there to make sure the game was in a complete state. Some of these included helping with UI, player mechanics, and the space station hub area."
                        }
                    ]
                },
                {
                    "name": "Stellar Winds",
                    "id": "stellarWinds",
                    "description": "A long-term project with miniature space exploration, realistically based physics, and procedurally generated 3D planets.",
                    "descriptionLong": "Stellar Winds is a game/simulation that started from a simple physics simulator I created for my high school AP physics course. I simulated celestial physics, allowing three stars to orbit around each other, creating a figure 8. After this, I started to further the physics and created a custom solar system with planets made in Blender. You can fly between the planets and explore them. This was the first year of on-and-off development, and I ended up publishing it on Itch.io. The next 6 months consisted of creating procedural generation tools for placing planets and creating 3D planets with water, atmospheres, caves, and more.",
                    "duration": "1.5 years",
                    "link": "https://chromecore.itch.io/stellar-winds",
                    "screenshots": [
                        1,
                        2,
                        3,
                        4,
                        5,
                        6,
                        7
                    ],
                    "credits": [
                        "Tayin Wallace - Sole Developer"
                    ],
                    "tools": [
                        "unity",
                        "csharp",
                        "photoshop",
                        "blender"
                    ],
                    "sections": [
                        {
                            "title": "Terrain Generation",
                            "body": "The generation part of this project consisted of many different parts. I had the main planet generation that used a marching cubes algorithm on the GPU as a compute shader to generate the terrain. Running it as a computer shader on the GPU allowed faster generation times. Marching cubes allowed me to make a larger planet type, some with missing cores, some that looked like asteroids, and some that had caves that would travel through the middle of the planet."
                        },
                        {
                            "title": "Planet Generation",
                            "body": "For the planets, I had a couple of other parts that used some simple generation to create things like water, atmosphere, and rings/asteroids. This would randomly pick variables like sizes and colors to create the elements. I then used custom shaders to display and color everything. My shaders included a ring, terrain, atmosphere, and water shader. They each had their own variables and custom looks. To get objects on the planets, I used a set of layered noise algorithms that were also run on the GPU to generate their positions."
                        },
                        {
                            "title": "Planet Placement",
                            "body": "To place the planets, I had to generate a set of rules for where and how close to each other they could be placed. I also had to create a custom time-based physics function that allowed me to see ahead in time to see if there were any collisions that would happen during a certain time period. This helped ensure a stable system that didn't collapse too quickly."
                        }
                    ]
                },
                {
                    "name": "Pigments",
                    "id": "pigments",
                    "description": "A game jam puzzle-platformer made in 48 hours where you switch, merge, and split colored pigments to solve puzzles.",
                    "descriptionLong": "Pigments was a short game made over 48 hours for the 2021 GMTK game jam. It was created as a puzzle-platformer where you control small pigment characters. Each character is tied to a specific color, and you are only affected by the environment when it is the same color. You can join and split colors apart to solve puzzles and reach the next room. After the game jam was over in 2025, I worked more on the project for a level design university course. I re-made the project with new levels and mechanics like doors, buttons, and ink.",
                    "duration": "48 hours",
                    "link": "https://chromecore.itch.io/pigments",
                    "screenshots": [
                        2,
                        1,
                        4,
                        3
                    ],
                    "credits": [
                        "Tayin Wallace - Sole Developer"
                    ],
                    "tools": [
                        "unity",
                        "csharp",
                        "photoshop"
                    ],
                    "sections": []
                },
                {
                    "name": "Grapple Side Scroller",
                    "id": "grappleSideScroller",
                    "description": "A short level design prototype created for a university course where you use a grappling hook to traverse quickly through a level.",
                    "descriptionLong": "This was a level design project for a university course. We created a gym, prototype, and multiple passes to try to create a well-designed level. The project consists of one level, with grappling as the main mechanic. The level progresses in difficulty, leading to some fun and challenging grapple platforming sections.",
                    "duration": "1 week",
                    "link": "https://chromecore.itch.io/side-scroller-level-design-project",
                    "screenshots": [
                        1,
                        2,
                        3
                    ],
                    "credits": [
                        "Tayin Wallace - Sole Developer"
                    ],
                    "tools": [
                        "unity",
                        "csharp",
                        "photoshop"
                    ],
                    "sections": []
                }
            ]
        },
        {
            "name": "Software",
            "projects": [
                {
                    "name": "Budgetized",
                    "id": "budgetized",
                    "description": "An IOS app published on the app store to help manage finances through budgets, categories, and accounts.",
                    "descriptionLong": "Budgetized is an app that stemmed from my desire to learn more about how mobile apps are developed. I started by creating a basic Hello World app using Figma and Dart. After this, I hopped into Figma and created a design for the project. I then created the app and used X-Code to publish it on the app store. The app helps you keep track of finances by using budgets, transactions, accounts, and categories.",
                    "duration": "3 months",
                    "link": "https://apps.apple.com/us/app/budgetized/id1658923604",
                    "screenshots": [
                        3,
                        1,
                        2
                    ],
                    "credits": [
                        "Tayin Wallace - Sole Developer"
                    ],
                    "tools": [
                        "dart",
                        "flutter",
                        "figma",
                        "photoshop"
                    ],
                    "sections": []
                },
                {
                    "name": "Space Generator",
                    "id": "spaceGenerator",
                    "description": "A web generator used to create randomly generated solar systems, stars, planets, and moons.",
                    "descriptionLong": "Space Generator is a short project I worked on in high school. It is composed of a simple generator that procedurally generates the variables for a planet, star, moon, asteroid, or star system. It uses realistic equations to generate the values.",
                    "duration": "1 month",
                    "link": "https://chromecore.itch.io/space-generator",
                    "screenshots": [
                        1,
                        2,
                        3
                    ],
                    "credits": [
                        "Tayin Wallace - Sole Developer"
                    ],
                    "tools": [
                        "unity",
                        "csharp"
                    ],
                    "sections": []
                },
                {
                    "name": "Portfolio Website",
                    "id": "portfolio",
                    "description": "My portfolio website (this site), created over multiple iterations using different tools.",
                    "descriptionLong": "My portfolio website consisted of 3 main designs and iterations. The first was a simple design using a template from Wix. The second site used basic HTML, CSS, and JavaScript and was deployed with Netlify. This version had a little more design and was a little more interactive. The last iteration is this website. It was created using React, Vite, CSS, and HTML. It was then published as a static website and has the best design.",
                    "duration": "1 week",
                    "link": "",
                    "screenshots": [
                        1,
                        2,
                        3,
                        4
                    ],
                    "credits": [
                        "Tayin Wallace - Sole Developer"
                    ],
                    "tools": [
                        "react",
                        "html",
                        "javaScript",
                        "css",
                        "vite",
                        "figma",
                        "git",
                        "github"
                    ],
                    "sections": []
                },
                {
                    "name": "Nexus - Worldbuilding",
                    "id": "nexusWorldBuilding",
                    "description": "An ongoing project where I am collecting data about worldbuilding topics ranging from stars and planets to life and technology.",
                    "descriptionLong": "Nexus is a world-building side project that stemmed from my Space Generator. This project is ongoing, with plans to be an interactive website/application where you can procedurally or manually create and store the worlds that you make. At the moment, the project is in its early stages. So far, I have collected all the notes, variables, units, and equations I need to accurately generate anything from planets and stars to life and galaxies. The following steps include the design process of what the application will look like and the tools that will be used.",
                    "duration": "on going",
                    "link": "",
                    "screenshots": [
                        1,
                        2,
                        3,
                        4
                    ],
                    "credits": [
                        "Tayin Wallace - Sole Developer"
                    ],
                    "tools": [
                        "notion"
                    ],
                    "sections": []
                }
            ]
        }
    ]
}